'use strict';
// Назва змінної повина інтуітивно вказувати на те що всередині 
// a-Z, 0-9, _, $

//=================================================================
/* Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”; */

let userName = prompt("Введіть своє ім'я");
if (userName) { alert(`Привіт, ${userName}`); }
else {
    console.log('Користувач не забажав знайомитися');
}


//=================================================================
/* Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу; */
// let currentYear = new Date().getFullYear();

let userBirthYear = prompt('Введіть свій рік народження');
if (userBirthYear) {
    const currentYear = 2026;
    let age = currentYear - userBirthYear;
    alert(`Тобі ${age}?`);
}
else console.log('Користувач не ввів рік народження');


//=================================================================
/* Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата  */

let side_square = prompt('Введіть сторону квадрату');
if (side_square) {
    alert(`Периметр квадрату = ${side_square * 4}`);
}
else console.log('Користувач не ввів сторону квадрату');

//=================================================================
/* Запитай у користувача радіус кола і виведи площу такої окружності. */

let radius = prompt('Введіть радіус кола');
if(radius){
alert(`Площа круга = ${(Math.PI * radius * radius).toFixed(2)}`);}
else console.log('Користувач не ввів радіус кола');
// Варіант 2: Через метод піднесення до степеня (більш професійно)
// alert(`Площа круга = ${Math.PI * Math.pow(radius, 2)}`);

// Варіант 3: Сучасний оператор піднесення до степеня **
// alert(`Площа круга = ${Math.PI * (radius ** 2)}`);
//залишить 2 знаки
// let area = Math.PI * (radius ** 2);
// alert(`Площа круга ≈ ${area.toFixed(2)}`);

//=================================================================
/*Запитай у користувача відстань в кілометрах між двома містами і 
за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.*/

let length = prompt('Відстань в кілометрах між двома містами');
if(length){let time = prompt('За скільки годин бажаєте дістатися');
let speed = length / time;
alert(`Швидкість з якою потрібно їхати - ${speed} км/год`);}
else console.log('Користувачу не потрібна ця опція');


//=================================================================
/*Реалізуй конвертор валют. Користувач вводить долари, програма переводить
 їх в євро. Курс валют зберігається в константі.*/

let dollar = prompt('Введіть кількість долларів');
if(dollar){const curs = 0.8622;
let euro = dollar * curs;
alert(`${dollar} USD = ${euro} EUR`);}
else console.log('Користувачу не потрібна ця опція');








/*
import { initCounter, resetCounter } from './counter.js';
const COUNTER_ID = 'visit-count';
const RESET_BTN_ID = 'reset-btn';

initCounter(COUNTER_ID);

const resetBtn = document.getElementById(RESET_BTN_ID);
if (resetBtn) {
    resetBtn.addEventListener('click', () => {
        resetCounter(COUNTER_ID);
    });
}*/